AI/event-management-load-test.yml
config:
  target: 'https://hamzakalech.com'
  phases:
    # Phase 1: Medium Load
    - duration: 1800  # 30 minutes
      arrivalRate: 45
      rampTo: 55
      name: "🟡 Medium Load (1)"
    # Phase 2: Light Load
    - duration: 1200  # 20 minutes
      arrivalRate: 10
      name: "🟢 Light Load (1)"
    # Phase 3: Heavy Load
    - duration: 1500  # 25 minutes
      arrivalRate: 90
      rampTo: 110
      name: "🔴 Heavy Load"
    # Phase 4: Medium Load (again)
    - duration: 1800  # 30 minutes
      arrivalRate: 45
      rampTo: 55
      name: "🟡 Medium Load (2)"
    # Phase 5: Light Load (again)
    - duration: 900   # 15 minutes
      arrivalRate: 10
      name: "🟢 Light Load (2)"

  http:
    pool: 50
    timeout: 30
    keepAlive: false

  tls:
    rejectUnauthorized: false

  processor: "./event-load-functions.js"

  plugins:
    ensure:
      p99: 5000
      maxErrorRate: 5

  variables:
    scalingTargets:
      - "3-5"     # Medium 1
      - "1-2"     # Light 1
      - "8-12"    # Heavy
      - "3-5"     # Medium 2
      - "1-2"     # Light 2

scenarios:
  # Scenario 1: CPU-Intensive Frontend Operations (30% of traffic)
  - name: "CPU Intensive Frontend"
    weight: 30
    flow:
      - function: "initializeTest"
      - function: "logPhaseInfo"
      
      # Multiple rapid requests to increase CPU load
      - loop:
          - get:
              url: "/"
              headers:
                User-Agent: "LoadTest-CPU-{{ $randomInt(1000, 9999) }}"
                Cache-Control: "no-cache, no-store, must-revalidate"
                Pragma: "no-cache"
          - think: 0.1
          - get:
              url: "/events"
              headers:
                Cache-Control: "no-cache"
          - think: 0.1
        count: "{{ $randomInt(3, 6) }}"
      
      # CPU stress operations
      - function: "cpuStressTest"
      
      # Concurrent asset loading to increase memory pressure
      - parallel:
          - get:
              url: "/main.js"
          - get:
              url: "/styles.css"
          - get:
              url: "/polyfills.js"
          - get:
              url: "/runtime.js"

  # Scenario 2: High-Pressure API Operations (50% of traffic)
  - name: "High Pressure API"
    weight: 50
    flow:
      - function: "initializeTest"
      
      # Rapid health checks to warm up
      - loop:
          - get:
              url: "/api/actuator/health"
              headers:
                Accept: "application/json"
                Cache-Control: "no-cache"
          - think: 0.05
        count: 3
      
      # Intensive event operations
      - get:
          url: "/api/events?size=50"  # Larger page size
          headers:
            Accept: "application/json"
            X-Load-Test: "high-pressure"
      
      # Multiple concurrent event creations
      - function: "generateEventData"
      - parallel:
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
              json:
                description: "{{ eventDescription }}-Parallel-1"
                date: "{{ eventDate }}"
                Number_of_tickets: "{{ ticketNumber }}"
                additional_notes: "{{ additionalNotes }}"
                place: "{{ eventPlace }}"
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
              json:
                description: "{{ eventDescription }}-Parallel-2"
                date: "{{ eventDate }}"
                Number_of_tickets: "{{ $randomInt(100, 500) }}"
                additional_notes: "Parallel creation stress test"
                place: "{{ eventPlace }}"
      
      # Database stress with large queries
      - loop:
          - get:
              url: "/api/events?page={{ $randomInt(0, 10) }}&size=100"
              headers:
                Accept: "application/json"
                X-Database-Stress: "true"
          - think: 0.2
          - function: "memoryStressTest"
        count: "{{ $randomInt(2, 5) }}"

  # Scenario 3: Memory and Database Intensive (20% of traffic)
  - name: "Memory Database Stress"
    weight: 20
    flow:
      - function: "memoryStressTest"
      - function: "cpuStressTest"
      
      # Large bulk operations
      - function: "generateBulkEventData"
      - loop:
          - post:
              url: "/api/events"
              headers:
                Content-Type: "application/json"
                X-Bulk-Memory-Test: "{{ $loopCount }}"
              json:
                description: "{{ bulkEventDescription }}-Memory-{{ $loopCount }}"
                date: "{{ bulkEventDate }}"
                Number_of_tickets: "{{ $randomInt(500, 1000) }}"  # Larger numbers
                additional_notes: "Memory stress test with large ticket count and extended description data that will consume more memory during processing and JSON serialization operations"
                place: "{{ bulkEventPlace }} - Extended location data"
          - function: "cpuStressTest"
          - think: 0.3
        count: "{{ $randomInt(4, 8) }}"
      
      # Concurrent large queries
      - parallel:
          - get:
              url: "/api/events?size=200"
          - get:
              url: "/api/events?page=0&size=150"
          - get:
              url: "/api/events?page=1&size=150"
      
      # Additional memory pressure
      - function: "memoryStressTest"